In [69]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from env import host, user, password

import seaborn as sns
from pydataset import data

<center><h1>Table of Contents</h1></center>

- <a href='#PS'>Pandas Series</a>
    - <a href='#howto'>How to Declare a Pandas Series</a>
    - <a href='#VO'>Vectorized Operations</a>
    - <a href='#series attributes'>Series Attributes</a>
        - <a href='#sindex'>.index</a>
        - <a href='#svalues'>.values</a>
        - <a href='#sdtype'>.dtype</a>
        - <a href='#sname'>.name</a>
        - <a href='#sshape'>.shape</a>
    - <a href='#seriesmethods'>Series Methods</a>
        - <a href='#headtailsample'>.head() .tail() .sample() </a>
        - <a href='#astype'>.astype()</a>
        - <a href='#valuecounts'>.value_counts()</a>
        - <a href='#describe'>.describe()</a>
        - <a href='#nlargest'>.nlargest() .nsmallest()</a>
        - <a href='#sortvaluesindex'>.sort_values() .sort_index()</a>
        - <a href='#isin'>.isin()</a>
        - <a href='#apply'>.apply()</a>
        - <a href='#pdcut'>pd.cut()</a>
    - <a href='#andor'>and/or statements</a>
    - <a href='#str'>.str</a>
        - <a href='#lower'>str.lower()</a>
        - <a href='#replace'>str.replace()</a>
        - <a href='#startswith'>str.startswith()</a>
        - <a href='#contains'>.str.contains()</a>
- <a href='#df'>Pandas Dataframes</a>
    - <a href='#dfatrributes'>Dataframe Attributes</a>
        - <a href='#dtypes'>dtypes</a>
        - <a href='#shape'>shape</a>
        - <a href='#columns'>columns</a>
        - <a href='#dfindex'>index</a>
    - <a href='#dfmethods'>Dataframe Methods</a>
        - <a href='#dfdescribe'>.describe()</a>
        - <a href='#dfinfo'>.info()</a>
        - <a href='#dfhead'>.head()</a>
        - <a href='#dfdrop'>.drop()</a>
        - <a href='#dfsort'>.sort_values()</a>
    - <a href='#newcol'>Create New Columns</a>
        - <a href='#assign'>.assign()</a>
    - <a href='#amc'>Accessing Multiple Columns</a>
    - <a href='#agg'>Aggregating</a>
    - <a href='#where'>np.where</a>

<a id='PS'><center><h1>Pandas Series</h1></center></a>

In [157]:
students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan', 'Josh', 'Josh','Josh']

In [242]:
simple_ints = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [79]:
simple_floats = [1.1, 2.2, 3.3, 4.4]

In [72]:
numbers =  ['$796,459.41', '$278.60', '$482,571.67',\
                     '$4,503,915.98', '$2,121,418.3', '$1,260,813.3',\
                     '$87,231.01', '$1,509,175.45', '$4,138,548.00', '$2,848,913.80',\
                     '$594,715.39', '$4,789,988.17', '$4,513,644.5', '$3,191,059.97',\
                     '$1,758,712.24', '$4,338,283.54', '$4,738,303.38', '$2,791,759.67',\
                     '$769,681.94', '$452,650.23']

<a id='howto'><center><h1>How to Declare a Pandas Series</h1></center></a>

In [158]:
students = pd.Series(students)

In [243]:
simple_ints = pd.Series(simple_ints)

In [75]:
numbers = pd.Series(numbers)

In [80]:
simple_floats = pd.Series(simple_floats)

<div class="alert alert-block alert-warning">
<b><h1>Type?</h1> You can use type() to let you know the type of any variable</b>

In [45]:
type(numbers)

pandas.core.series.Series

<a id='VO'><center><h1>Vectorized Operations</h1></center></a>

In [207]:
students + " Chavez"

0       Sally Chavez
1        Jane Chavez
2       Suzie Chavez
3       Billy Chavez
4         Ada Chavez
5        John Chavez
6      Thomas Chavez
7       Marie Chavez
8      Albert Chavez
9     Richard Chavez
10      Isaac Chavez
11       Alan Chavez
12       Josh Chavez
13       Josh Chavez
14       Josh Chavez
dtype: object

In [48]:
simple_ints + 3

0     4
1     5
2     6
3     7
4     8
5     9
6    10
7    11
8    12
9    13
dtype: int64

In [47]:
simple_ints > 3

0    False
1    False
2    False
3     True
4     True
5     True
6     True
7     True
8     True
9     True
dtype: bool

<a id='series attributes'><center><h1>Series Attributes</h1></center></a>

<a id='sindex'><h3>.index</h3></a>

In [334]:
numbers.index

RangeIndex(start=0, stop=20, step=1)

In [61]:
numbers.index[3] #returns the value of the "index".  Not corresponding column value

3

In [63]:
numbers.index.values

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19])

<a id='svalues'><h3>.values</h3></a>

In [62]:
numbers.values

array(['$796,459.41', '$278.60', '$482,571.67', '$4,503,915.98',
       '$2,121,418.3', '$1,260,813.3', '$87,231.01', '$1,509,175.45',
       '$4,138,548.00', '$2,848,913.80', '$594,715.39', '$4,789,988.17',
       '$4,513,644.5', '$3,191,059.97', '$1,758,712.24', '$4,338,283.54',
       '$4,738,303.38', '$2,791,759.67', '$769,681.94', '$452,650.23'],
      dtype=object)

In [86]:
numbers.values[0]

'$796,459.41'

In [65]:
type(numbers.values) #returns a numpy array

numpy.ndarray

<a id='sdtype'><h3>.dtype</h3></a>

In [81]:
simple_floats.dtype

dtype('float64')

In [77]:
students.dtype #type O for objects strings are considered Objects

dtype('O')

In [78]:
simple_ints.dtype

dtype('int64')

<a id='sname'><h3>.name</h3></a>

In [84]:
simple_floats.name = "simple floats"

In [85]:
simple_floats.name

'simple floats'

<a id='sshape'><h3>.shape</h3></a>

In [88]:
simple_floats.shape

(4,)

In [89]:
students.shape

(12,)

In [90]:
simple_ints.shape

(10,)

In [91]:
numbers.shape

(20,)

<a id='seriesmethods'><center><h1>Series Methods</h1></center></a>

<a id='headtailsample'><h3>.head() .tail() .sample()</h3></a>

In [96]:
numbers.head() # First 5 Values

0      $796,459.41
1          $278.60
2      $482,571.67
3    $4,503,915.98
4     $2,121,418.3
dtype: object

In [97]:
numbers.tail() # Last 5 Values

15    $4,338,283.54
16    $4,738,303.38
17    $2,791,759.67
18      $769,681.94
19      $452,650.23
dtype: object

In [102]:
numbers.sample(5) #Random Values, notice I had to tell it I wanted 5 Values, default is one random number

6        $87,231.01
2       $482,571.67
9     $2,848,913.80
1           $278.60
15    $4,338,283.54
dtype: object

<a id='astype'><h3>.astype()</h3></a>

In [105]:
simple_ints.astype("float")

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64

In [104]:
simple_floats.astype("int")

0    1
1    2
2    3
3    4
Name: simple floats, dtype: int64

<a id='valuecounts'><h3>.value_counts()</h3></a>

In [114]:
students.value_counts()

Josh       3
John       1
Billy      1
Jane       1
Albert     1
Suzie      1
Marie      1
Isaac      1
Alan       1
Thomas     1
Sally      1
Richard    1
Ada        1
dtype: int64

<a id='describe'><h3>.describe()</h3></a>

In [115]:
students.describe()

count       15
unique      13
top       Josh
freq         3
dtype: object

In [117]:
numbers.describe()

count               20
unique              20
top       $1,260,813.3
freq                 1
dtype: object

In [118]:
simple_ints.describe()

count    10.00000
mean      5.50000
std       3.02765
min       1.00000
25%       3.25000
50%       5.50000
75%       7.75000
max      10.00000
dtype: float64

<a id='nlargest'><h3>.nlargest() .nsmallest()</h3></a>

In [119]:
simple_floats.nlargest()

3    4.4
2    3.3
1    2.2
0    1.1
Name: simple floats, dtype: float64

In [123]:
simple_floats.nlargest().head(1)

3    4.4
Name: simple floats, dtype: float64

In [120]:
simple_ints.nsmallest()

0    1
1    2
2    3
3    4
4    5
dtype: int64

<a id='sortvaluesindex'><h3>.sort_values() .sort_index()</h3></a>

In [127]:
simple_ints.sort_values(ascending=False)

9    10
8     9
7     8
6     7
5     6
4     5
3     4
2     3
1     2
0     1
dtype: int64

In [135]:
simple_ints.sort_values(ascending=False)

9    10
8     9
7     8
6     7
5     6
4     5
3     4
2     3
1     2
0     1
dtype: int64

<div class="alert alert-block alert-warning">
<b><h1>sort_values(By="?")</h1> Series does not have by='example', that is a DataFrame</b>

<a id='isin'><h3>.isin()</h3></a>

In [191]:
vowels = list('aeiou')
vowels

['a', 'e', 'i', 'o', 'u']

In [192]:
letters = list('abcdefghijk')
letters

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k']

<a id='.apply'><h3>.apply()</h3></a>

<a id='andor'><center><h1>And/Or Statements</h1></center></a>

In [144]:
(simple_ints % 2 == 0) & (simple_ints> 7) #And statement Even and greater than 7 returns boolean mask

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
9     True
dtype: bool

In [141]:
simple_ints[(simple_ints % 2 == 0) & (simple_ints> 7)] #And statement Even and greater than 7

7     8
9    10
dtype: int64

In [147]:
(simple_ints % 2 != 0) | (simple_ints > 5) #Odd or great than 5 Boolean mask

0     True
1    False
2     True
3    False
4     True
5     True
6     True
7     True
8     True
9     True
dtype: bool

In [148]:
simple_ints[(simple_ints % 2 != 0) | (simple_ints > 5)]# returned Values

0     1
2     3
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

<a id='str'><center><h1>.str</h1></center></a>

<a id='lower'><h3>str.lower()</h3></a>

In [172]:
students.tail(5)

10    Isaac
11     Alan
12     Josh
13     Josh
14     Josh
dtype: object

In [171]:
students.str.lower().tail(5)

10    isaac
11     alan
12     josh
13     josh
14     josh
dtype: object

<a id='replace'><h3>str.replace()</h3></a>

In [170]:
numbers.str.replace("$", "").head(5)

<ipython-input-170-bf63bb9351cd>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  numbers.str.replace("$", "").head(5)

0      796,459.41
1          278.60
2      482,571.67
3    4,503,915.98
4     2,121,418.3
dtype: object

In [174]:
numbers.head(5) #notice the orginal numbers is not mutated

0      $796,459.41
1          $278.60
2      $482,571.67
3    $4,503,915.98
4     $2,121,418.3
dtype: object

<a id='startswith'><h3>str.startswith()</h3></a>

In [208]:
students.str.startswith("J") #returns Boolean Mask

0     False
1      True
2     False
3     False
4     False
5      True
6     False
7     False
8     False
9     False
10    False
11    False
12     True
13     True
14     True
dtype: bool

In [219]:
students[students.str.startswith("J")]

1     Jane
5     John
12    Josh
13    Josh
14    Josh
dtype: object

In [181]:
numbers.str.startswith("$").head(5) # remember numbers is a string

0    True
1    True
2    True
3    True
4    True
dtype: bool

In [183]:
numbers[numbers.str.startswith("$")].head(5)

0      $796,459.41
1          $278.60
2      $482,571.67
3    $4,503,915.98
4     $2,121,418.3
dtype: object

<a id='contains'><h3>str.contains()</h3></a>

In [186]:
students.str.contains("Jo").tail(5) # Returns Boolean Mask

10    False
11    False
12     True
13     True
14     True
dtype: bool

In [187]:
students[students.str.contains("Jo")].tail(5)

5     John
12    Josh
13    Josh
14    Josh
dtype: object

<a id='isin'><h3>.isin()</h3></a>

In [190]:
vowels = list('aeiou')
vowels

['a', 'e', 'i', 'o', 'u']

In [220]:
letters = list('abcdefghijk')
letters

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k']

In [222]:
letters_series = pd.Series(letters)
letters_series

0     a
1     b
2     c
3     d
4     e
5     f
6     g
7     h
8     i
9     j
10    k
dtype: object

In [224]:
Boolean_mask = letters_series.isin(vowels)

In [226]:
Boolean_mask

0      True
1     False
2     False
3     False
4      True
5     False
6     False
7     False
8      True
9     False
10    False
dtype: bool

In [225]:
letters_series[Boolean_mask]

0    a
4    e
8    i
dtype: object

<a id='apply'><h3>.apply()</h3></a>

In [231]:
def times5(input_value):
        return input_value *5

In [232]:
new_series = simple_ints.apply(times5)  #Same a the example below using lambda

In [228]:
new_series

0     5
1    10
2    15
3    20
4    25
5    30
6    35
7    40
8    45
9    50
dtype: int64

In [236]:
new_series = simple_ints.apply(lambda x : x *5) #Same as creating a function as above

In [237]:
new_series

0     5
1    10
2    15
3    20
4    25
5    30
6    35
7    40
8    45
9    50
dtype: int64

In [ ]:
# if and else statement inside lambda example below

In [246]:
new_series = simple_ints.apply(lambda simple_ints : True if simple_ints > 5 else False)

In [247]:
new_series

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
9     True
dtype: bool

<a id='pdcut'><h3>pd.cut()</h3></a>

In [260]:
s = pd.Series(list(range(16)))
s

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
dtype: int64

In [261]:
pd.cut(s, bins=4)

0     (-0.015, 3.75]
1     (-0.015, 3.75]
2     (-0.015, 3.75]
3     (-0.015, 3.75]
4        (3.75, 7.5]
5        (3.75, 7.5]
6        (3.75, 7.5]
7        (3.75, 7.5]
8       (7.5, 11.25]
9       (7.5, 11.25]
10      (7.5, 11.25]
11      (7.5, 11.25]
12     (11.25, 15.0]
13     (11.25, 15.0]
14     (11.25, 15.0]
15     (11.25, 15.0]
dtype: category
Categories (4, interval[float64]): [(-0.015, 3.75] < (3.75, 7.5] < (7.5, 11.25] < (11.25, 15.0]]

In [262]:
pd.cut(s, 3).value_counts() # you can use value counts on your bins

(-0.015, 5.0]    6
(5.0, 10.0]      5
(10.0, 15.0]     5
dtype: int64

In [265]:
pd.cut(s, bins=4, labels=["0-3", "4-7", "8-11", "12-15"]) #using labels

0       0-3
1       0-3
2       0-3
3       0-3
4       4-7
5       4-7
6       4-7
7       4-7
8      8-11
9      8-11
10     8-11
11     8-11
12    12-15
13    12-15
14    12-15
15    12-15
dtype: category
Categories (4, object): ['0-3' < '4-7' < '8-11' < '12-15']

<a id='df'><center><h1>Pandas Dataframes</h1></center></a>

In [267]:
import pandas as pd
import numpy as np

np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})

<a id='dfatrributes'><center><h1>Dataframes Attributes</h1></center></a>

<a id='dtypes'><h3>.dtypes</h3></a>

In [280]:
df.dtypes

name       object
math        int64
english     int64
reading     int64
dtype: object

<a id='shape'><h3>.shape</h3></a>

In [281]:
df.shape

(12, 4)

<a id='columns'><h3>.columns</h3></a>

In [282]:
df.columns

Index(['name', 'math', 'english', 'reading'], dtype='object')

<a id='dfindex'><h3>.index</h3></a>

In [283]:
df.index

RangeIndex(start=0, stop=12, step=1)

<a id='dfmethods'><center><h1>Dataframes Methods</h1></center></a>

<a id='dfdescribe'><h3>.describe()</h3></a>

In [287]:
df.describe()

            math    english    reading
count  12.000000  12.000000  12.000000
mean   84.833333  77.666667  86.500000
std    11.134168  13.371158   9.643651
min    62.000000  62.000000  67.000000
25%    78.500000  63.750000  80.750000
50%    90.000000  77.500000  89.000000
75%    92.250000  86.750000  93.250000
max    98.000000  99.000000  98.000000

<a id='dfinfo'><h3>.info()</h3></a>

In [270]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     12 non-null     object
 1   math     12 non-null     int64
 2   english  12 non-null     int64
 3   reading  12 non-null     int64
dtypes: int64(3), object(1)
memory usage: 512.0+ bytes

<a id='dfhead'><h3>.head()</h3></a>

In [286]:
df.head()

    name  math  english  reading
0  Sally    62       85       80
1   Jane    88       79       67
2  Suzie    94       74       95
3  Billy    98       96       88
4    Ada    77       92       98

<a id='dfrename'><h3>.rename()</h3></a>

In [291]:
df.rename(columns={'name': 'student'})

    student  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

<a id='dfdrop'><h3>.drop()</h3></a>

In [292]:
df.drop(columns=['english', 'reading'])

       name  math
0     Sally    62
1      Jane    88
2     Suzie    94
3     Billy    98
4       Ada    77
5      John    79
6    Thomas    82
7     Marie    93
8    Albert    92
9   Richard    69
10    Isaac    92
11     Alan    92

In [289]:
df.drop(columns=['english', 'reading']).rename(columns={'name': 'student'})

    student  math
0     Sally    62
1      Jane    88
2     Suzie    94
3     Billy    98
4       Ada    77
5      John    79
6    Thomas    82
7     Marie    93
8    Albert    92
9   Richard    69
10    Isaac    92
11     Alan    92

<a id='dfsort'><h3>.sort_values()</h3></a>

In [315]:
df.sort_values(by='english').head() #notice the by= you can sort by two values

      name  math  english  reading  passing_math
8   Albert    92       62       87          True
11    Alan    92       62       72          True
7    Marie    93       63       90          True
6   Thomas    82       64       81          True
2    Suzie    94       74       95          True

In [316]:
df.sort_values(by=['english', 'reading']).head() #sort by two vaules

      name  math  english  reading  passing_math
11    Alan    92       62       72          True
8   Albert    92       62       87          True
7    Marie    93       63       90          True
6   Thomas    82       64       81          True
2    Suzie    94       74       95          True

<a id='newcol'><center><h1>Create New Columns</h1></center></a>

In [299]:
df['passing_math'] = df.math > 70

In [303]:
df.head()

    name  math  english  reading  passing_math
0  Sally    62       85       80         False
1   Jane    88       79       67          True
2  Suzie    94       74       95          True
3  Billy    98       96       88          True
4    Ada    77       92       98          True

<a id='assign'><h3>.assign()</h3></a>

In [306]:
df.assign(passing_english=df.english >= 70).head()

    name  math  english  reading  passing_math  passing_english
0  Sally    62       85       80         False             True
1   Jane    88       79       67          True             True
2  Suzie    94       74       95          True             True
3  Billy    98       96       88          True             True
4    Ada    77       92       98          True             True

<a id='amc'><center><h1>Accessing Multiple Columns</h1></center></a>

In [311]:
df[['name', 'math']].head()#can call the columns this way

    name  math
0  Sally    62
1   Jane    88
2  Suzie    94
3  Billy    98
4    Ada    77

In [314]:
columns = ['name', 'math'] # or can call them this way
df[columns].head()

    name  math
0  Sally    62
1   Jane    88
2  Suzie    94
3  Billy    98
4    Ada    77

In [312]:
df[['name', 'math']].sort_values(by='math', ascending=False).head()

      name  math
3    Billy    98
2    Suzie    94
7    Marie    93
8   Albert    92
10   Isaac    92

<a id='agg'><center><h1>Aggregating</h1></center></a>

In [317]:
df.reading.agg('min')

67

In [319]:
df[['english', 'reading', 'math']].agg(['mean', 'min', 'max'])

        english  reading       math
mean  77.666667     86.5  84.833333
min   62.000000     67.0  62.000000
max   99.000000     98.0  98.000000

<a id='groupby'><center><h1>Group By</h1></center></a>

In [324]:
df.groupby("passing_math").math.agg(['min', 'mean', 'max']) #group by must have .agg function

              min  mean  max
passing_math
False          62  65.5   69
True           77  88.7   98

In [325]:
df.groupby("passing_math").english.agg(['min', 'mean', 'max']) #group by must have .agg function

              min  mean  max
passing_math
False          80  82.5   85
True           62  76.7   99

In [ ]:
#Groupby & Where example problem from Exercise
#mam[['hoppers', 'speed']].where((mam['speed']>(mam['speed']).median()) & (mam['hoppers']==True)).sort_values(by=['speed'], ascending=False).dropna().count())

<a id='where'><center><h1>np.where</h1></center></a>

In [331]:
df['passing_math'] = np.where(df.math < 70, 'failing', 'passing')# Create the new column based on an existing column

In [330]:
df.head()

    name  math  english  reading passing_math
0  Sally    62       85       80      failing
1   Jane    88       79       67      passing
2  Suzie    94       74       95      passing
3  Billy    98       96       88      passing
4    Ada    77       92       98      passing

In [ ]:
#Groupby & Where example problem from Exercise
#mam[['hoppers', 'speed']].where((mam['speed']>(mam['speed']).median()) & (mam['hoppers']==True)).sort_values(by=['speed'], ascending=False).dropna().count())